Repository: ulascandundar/Erp
Catalog: Erp.Domain/Resources/SharedResource.*.resx
Languages: tr

source: User not found
tr: Kullanıcı bulunamadı

source: Product not found
tr: Ürün bulunamadı

source: Category not found
tr: Kategori bulunamadı

source: Company not found
tr: Şirket bulunamadı

# UserNotBelongToCompany
source: User does not belong to a company
tr: Kullanıcı bir şirkete bağlı değil

# CategoryNameAlreadyExists
source: This category name is already in use in your company
tr: Bu kategori adı şirketinizde zaten kullanılmaktadır

source: Invalid verification code
tr: Doğrulama kodu geçersiz

# InvalidCredentials
source: Email or password is incorrect
tr: Email yada şifre yanlış

# ProductNameAlreadyExists
source: This product name is already in use in your company
tr: Bu ürün adı şirketinizde zaten kullanılmaktadır

# SkuAlreadyExists
source: This SKU is already in use in your company
tr: Bu SKU şirketinizde zaten kullanılmaktadır

# BarcodeAlreadyExists
source: This barcode is already in use in your company
tr: Bu barkod şirketinizde zaten kullanılmaktadır

# EmailAlreadyExists
source: This email address is already in use
tr: Bu e-posta adresi zaten kullanılmaktadır

# PhoneNumberAlreadyExists
source: This phone number is already in use
tr: Bu telefon numarası zaten kullanılmaktadır

# TaxNumberAlreadyExists
source: This tax number is already in use
tr: Bu vergi numarası zaten kullanılmaktadır

# OrderPlacementError
source: An error occurred while placing the order
tr: Sipariş oluşturulurken bir hata oluştu

# UnitNameAlreadyExists
source: This unit name is already in use in your company or is a global unit
tr: Bu birim adı şirketinizde zaten kullanılmaktadır veya global bir birimdir

# UnitShortCodeAlreadyExists
source: This unit short code is already in use in your company or is a global unit
tr: Bu birim kısa kodu şirketinizde zaten kullanılmaktadır veya global bir birimdir

source: Unit not found
tr: Birim bulunamadı

# UnitHasProductRawMaterial
source: This unit cannot be deleted because it is used in product raw materials
tr: Bu birim, ürün hammaddelerinde kullanıldığı için silinemez

# UnitHasChildUnit
source: This unit cannot be deleted because it is used as a root unit for other units
tr: Bu birim, diğer birimlerin ana birimi olarak kullanıldığı için silinemez

# UnitHasProductFormulation
source: This unit cannot be deleted because it is used in product formulations
tr: Bu birim, ürün formülasyonlarında kullanıldığı için silinemez

source: Raw material not found
tr: Hammadde bulunamadı

# UnitTypeMismatch
source: Cannot convert between different unit types
tr: Farklı birim türleri arasında dönüşüm yapılamaz

# RequiredField
source: {0} field is required
tr: {0} alanı zorunludur

# InvalidEmail
source: Invalid email address
tr: Geçersiz e-posta adresi

# InvalidPassword
source: Password must be at least 8 characters long and contain at least one uppercase letter, one lowercase letter, and one number
tr: Şifre en az 8 karakter uzunluğunda olmalı ve en az bir büyük harf, bir küçük harf ve bir rakam içermelidir

source: Invalid phone number
tr: Geçersiz telefon numarası

source: Invalid tax number
tr: Geçersiz vergi numarası

# TcknRequired
source: Turkish ID Number is required
tr: TC Kimlik Numarası zorunludur

# TcknLength
source: Turkish ID Number must be 11 digits
tr: TC Kimlik Numarası 11 haneli olmalıdır

# FirstNameRequired
source: First name is required
tr: Ad alanı zorunludur

# LastNameRequired
source: Last name is required
tr: Soyad alanı zorunludur

# PhoneNumberRequired
source: Phone number is required
tr: Telefon numarası zorunludur

# PhoneNumberLength
source: Phone number must be 10 digits
tr: Telefon numarası 10 haneli olmalıdır

# AddressRequired
source: Address is required
tr: Adres alanı zorunludur

# CityRequired
source: City is required
tr: Şehir alanı zorunludur

# OrderItemsRequired
source: Order must have at least one item
tr: Siparişte en az bir ürün olmalıdır

# PaymentsRequired
source: Order must have at least one payment
tr: Siparişte en az bir ödeme olmalıdır

# ProductRequired
source: Product is required
tr: Ürün seçimi zorunludur

# QuantityGreaterThanZero
source: Quantity must be greater than zero
tr: Miktar sıfırdan büyük olmalıdır

# TotalAmountNotNegative
source: Total amount cannot be negative
tr: Toplam tutar negatif olamaz

# PaymentAmountGreaterThanZero
source: Payment amount must be greater than zero
tr: Ödeme tutarı sıfırdan büyük olmalıdır

# PaymentMethodRequired
source: Payment method selection is required
tr: Ödeme yöntemi seçimi zorunludur

source: Invalid payment method
tr: Geçersiz ödeme yöntemi

# UnitNameRequired
source: Unit name is required
tr: Birim adı zorunludur

# UnitNameMaxLength
source: Unit name cannot exceed 50 characters
tr: Birim adı 50 karakteri geçemez

# UnitShortCodeRequired
source: Unit short code is required
tr: Birim kısa kodu zorunludur

# UnitShortCodeMaxLength
source: Unit short code cannot exceed 10 characters
tr: Birim kısa kodu 10 karakteri geçemez

# UnitDescriptionMaxLength
source: Unit description cannot exceed 500 characters
tr: Birim açıklaması 500 karakteri geçemez

# UnitConversionRateGreaterThanZero
source: Conversion rate must be greater than zero
tr: Dönüşüm oranı sıfırdan büyük olmalıdır

# UnitRootUnitIdRequired
source: Root unit selection is required
tr: Ana birim seçimi zorunludur

# OperationSuccessful
source: Operation completed successfully
tr: İşlem başarıyla tamamlandı

# RecordCreated
source: Record created successfully
tr: Kayıt başarıyla oluşturuldu

# RecordUpdated
source: Record updated successfully
tr: Kayıt başarıyla güncellendi

# RecordDeleted
source: Record deleted successfully
tr: Kayıt başarıyla silindi
